Strooom/STM32WLE5x-SX126X-LoRaWAN/src/general/stm32wle5.h
// #############################################################################
// ### This file is part of the source code for the MuMo project             ###
// ### https://github.com/Strooom/MuMo-v2-Node-SW                            ###
// ### Author(s) : Pascal Roobrouck - @strooom                               ###
// ### License : https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode ###
// #############################################################################

// This is a header file with definitions of all registers / peripherals / etc. of the STM32WLE5 MCU.
// ST defines this is stm32wle5xx.h, but in a style which is harder to read and use.
// So I include this stm32wle5xx.h file here, and derive some new definitions from it which are simpler to use.

#pragma once
#include <stdint.h>

// #########################
// ### Cortex M4 General ###
// #########################

enum class stm32wle5xxInterruptSource : int8_t {
    // Cortex-M4 Processor Exceptions Numbers
    NonMaskableInt_IRQn   = -14,        //  Non Maskable Interrupt                                            */
    HardFault_IRQn        = -13,        //  Cortex-M4 Hard Fault Interrupt                                    */
    MemoryManagement_IRQn = -12,        //  Cortex-M4 Memory Management Interrupt                             */
    BusFault_IRQn         = -11,        //  Cortex-M4 Bus Fault Interrupt                                     */
    UsageFault_IRQn       = -10,        //  Cortex-M4 Usage Fault Interrupt                                   */
    SVCall_IRQn           = -5,         //  Cortex-M4 SV Call Interrupt                                       */
    DebugMonitor_IRQn     = -4,         //  Cortex-M4 Debug Monitor Interrupt                                 */
    PendSV_IRQn           = -2,         //  Cortex-M4 Pend SV Interrupt                                       */
    SysTick_IRQn          = -1,         //  Cortex-M4 System Tick Interrupt                                   */

    //  STM32WLxx specific Interrupt Numbers on M4 core
    WWDG_IRQn                   = 0,         //  Window WatchDog Interrupt                                         */
    PVD_PVM_IRQn                = 1,         //  PVD and PVM detector                                              */
    TAMP_STAMP_LSECSS_SSRU_IRQn = 2,         //  RTC Tamper, RTC TimeStamp, LSECSS and RTC SSRU Interrupts         */
    RTC_WKUP_IRQn               = 3,         //  RTC Wakeup Interrupt                                              */
    FLASH_IRQn                  = 4,         //  FLASH (CFI)  global Interrupt                                     */
    RCC_IRQn                    = 5,         //  RCC Interrupt                                                     */
    EXTI0_IRQn                  = 6,         //  EXTI Line 0 Interrupt                                             */
    EXTI1_IRQn                  = 7,         //  EXTI Line 1 Interrupt                                             */
    EXTI2_IRQn                  = 8,         //  EXTI Line 2 Interrupt                                             */
    EXTI3_IRQn                  = 9,         //  EXTI Line 3 Interrupt                                             */
    EXTI4_IRQn                  = 10,        //  EXTI Line 4 Interrupt                                             */
    DMA1_Channel1_IRQn          = 11,        //  DMA1 Channel 1 Interrupt                                          */
    DMA1_Channel2_IRQn          = 12,        //  DMA1 Channel 2 Interrupt                                          */
    DMA1_Channel3_IRQn          = 13,        //  DMA1 Channel 3 Interrupt                                          */
    DMA1_Channel4_IRQn          = 14,        //  DMA1 Channel 4 Interrupt                                          */
    DMA1_Channel5_IRQn          = 15,        //  DMA1 Channel 5 Interrupt                                          */
    DMA1_Channel6_IRQn          = 16,        //  DMA1 Channel 6 Interrupt                                          */
    DMA1_Channel7_IRQn          = 17,        //  DMA1 Channel 7 Interrupt                                          */
    ADC_IRQn                    = 18,        //  ADC Interrupt                                                     */
    DAC_IRQn                    = 19,        //  DAC Interrupt                                                     */
    COMP_IRQn                   = 21,        //  COMP1 and COMP2 Interrupts                                        */
    EXTI9_5_IRQn                = 22,        //  EXTI Lines [9:5] Interrupt                                        */
    TIM1_BRK_IRQn               = 23,        //  TIM1 Break Interrupt                                              */
    TIM1_UP_IRQn                = 24,        //  TIM1 Update Interrupt                                             */
    TIM1_TRG_COM_IRQn           = 25,        //  TIM1 Trigger and Communication Interrupts                         */
    TIM1_CC_IRQn                = 26,        //  TIM1 Capture Compare Interrupt                                    */
    TIM2_IRQn                   = 27,        //  TIM2 Global Interrupt                                             */
    TIM16_IRQn                  = 28,        //  TIM16 Global Interrupt                                            */
    TIM17_IRQn                  = 29,        //  TIM17 Global Interrupt                                            */
    I2C1_EV_IRQn                = 30,        //  I2C1 Event Interrupt                                              */
    I2C1_ER_IRQn                = 31,        //  I2C1 Error Interrupt                                              */
    I2C2_EV_IRQn                = 32,        //  I2C2 Event Interrupt                                              */
    I2C2_ER_IRQn                = 33,        //  I2C2 Error Interrupt                                              */
    SPI1_IRQn                   = 34,        //  SPI1 Interrupt                                                    */
    SPI2_IRQn                   = 35,        //  SPI2 Interrupt                                                    */
    USART1_IRQn                 = 36,        //  USART1 Interrupt                                                  */
    USART2_IRQn                 = 37,        //  USART2 Interrupt                                                  */
    LPUART1_IRQn                = 38,        //  LPUART1 Interrupt                                                 */
    LPTIM1_IRQn                 = 39,        //  LPTIM1 Global Interrupt                                           */
    LPTIM2_IRQn                 = 40,        //  LPTIM2 Global Interrupt                                           */
    EXTI15_10_IRQn              = 41,        //  EXTI Lines [15:10] Interrupt                                      */
    RTC_Alarm_IRQn              = 42,        //  RTC Alarms (A and B) Interrupt                                    */
    LPTIM3_IRQn                 = 43,        //  LPTIM3 Global Interrupt                                           */
    SUBGHZSPI_IRQn              = 44,        //  SUBGHZSPI Interrupt                                               */
    HSEM_IRQn                   = 47,        //  HSEM Interrupt                                                    */
    I2C3_EV_IRQn                = 48,        //  I2C3 Event Interrupt                                              */
    I2C3_ER_IRQn                = 49,        //  I2C3 Error Interrupt                                              */
    SUBGHZ_Radio_IRQn           = 50,        //  SUBGHZ Radio Interrupt                                            */
    AES_IRQn                    = 51,        //  AES Interrupt                                                     */
    RNG_IRQn                    = 52,        //  RNG Interrupt                                                     */
    PKA_IRQn                    = 53,        //  PKA Interrupt                                                     */
    DMA2_Channel1_IRQn          = 54,        //  DMA2 Channel 1 Interrupt                                          */
    DMA2_Channel2_IRQn          = 55,        //  DMA2 Channel 2 Interrupt                                          */
    DMA2_Channel3_IRQn          = 56,        //  DMA2 Channel 3 Interrupt                                          */
    DMA2_Channel4_IRQn          = 57,        //  DMA2 Channel 4 Interrupt                                          */
    DMA2_Channel5_IRQn          = 58,        //  DMA2 Channel 5 Interrupt                                          */
    DMA2_Channel6_IRQn          = 59,        //  DMA2 Channel 6 Interrupt                                          */
    DMA2_Channel7_IRQn          = 60,        //  DMA2 Channel 7 Interrupt                                          */
    DMAMUX1_OVR_IRQn            = 61         //  DMAMUX1 overrun Interrupt                                         */
};

// #############################
// ### STM32WLE5 Peripherals ###
// #############################

#define FLASH_BASE        0x08000000UL        //  FLASH(up to 256 KB) base address */
#define SYSTEM_FLASH_BASE 0x1FFF0000UL        //  System FLASH(28Kb) base address */
#define SRAM1_BASE        0x20000000UL        //  SRAM1(up to 32 KB) base address */
#define SRAM2_BASE        0x20008000UL        //  SRAM2(up to 32 KB) base address */
#define PERIPH_BASE       0x40000000UL        //  Peripheral base address */

#define APB1PERIPH_BASE PERIPH_BASE
#define APB2PERIPH_BASE (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x08000000UL)
#define AHB3PERIPH_BASE (PERIPH_BASE + 0x18000000UL)
#define APB3PERIPH_BASE (PERIPH_BASE + 0x18010000UL)

