Strooom/STM32WLE5x-SX126X-LoRaWAN/src/general/stm32wle5.h
//  APB1 peripherals */
#define TIM2_BASE    (APB1PERIPH_BASE + 0x00000000UL)
#define RTC_BASE     (APB1PERIPH_BASE + 0x00002800UL)
#define WWDG_BASE    (APB1PERIPH_BASE + 0x00002C00UL)
#define IWDG_BASE    (APB1PERIPH_BASE + 0x00003000UL)
#define SPI2_BASE    (APB1PERIPH_BASE + 0x00003800UL)
#define USART2_BASE  (APB1PERIPH_BASE + 0x00004400UL)
#define I2C1_BASE    (APB1PERIPH_BASE + 0x00005400UL)
#define I2C2_BASE    (APB1PERIPH_BASE + 0x00005800UL)
#define I2C3_BASE    (APB1PERIPH_BASE + 0x00005C00UL)
#define DAC_BASE     (APB1PERIPH_BASE + 0x00007400UL)
#define LPTIM1_BASE  (APB1PERIPH_BASE + 0x00007C00UL)
#define LPUART1_BASE (APB1PERIPH_BASE + 0x00008000UL)
#define LPTIM2_BASE  (APB1PERIPH_BASE + 0x00009400UL)
#define LPTIM3_BASE  (APB1PERIPH_BASE + 0x00009800UL)
#define TAMP_BASE    (APB1PERIPH_BASE + 0x0000B000UL)

//  APB2 peripherals */
#define SYSCFG_BASE     (APB2PERIPH_BASE + 0x00000000UL)
#define VREFBUF_BASE    (APB2PERIPH_BASE + 0x00000030UL)
#define COMP1_BASE      (APB2PERIPH_BASE + 0x00000200UL)
#define COMP2_BASE      (APB2PERIPH_BASE + 0x00000204UL)
#define ADC_BASE        (APB2PERIPH_BASE + 0x00002400UL)
#define ADC_COMMON_BASE (APB2PERIPH_BASE + 0x00002708UL)
#define TIM1_BASE       (APB2PERIPH_BASE + 0x00002C00UL)
#define SPI1_BASE       (APB2PERIPH_BASE + 0x00003000UL)
#define USART1_BASE     (APB2PERIPH_BASE + 0x00003800UL)
#define TIM16_BASE      (APB2PERIPH_BASE + 0x00004400UL)
#define TIM17_BASE      (APB2PERIPH_BASE + 0x00004800UL)

//  AHB1 peripherals */
#define DMA1_BASE    (AHB1PERIPH_BASE + 0x00000000UL)
#define DMA2_BASE    (AHB1PERIPH_BASE + 0x00000400UL)
#define DMAMUX1_BASE (AHB1PERIPH_BASE + 0x00000800UL)
#define CRC_BASE     (AHB1PERIPH_BASE + 0x00003000UL)

//  AHB2 peripherals */
#define IOPORT_BASE (AHB2PERIPH_BASE + 0x00000000UL)
#define GPIOA_BASE  (IOPORT_BASE + 0x00000000UL)
#define GPIOB_BASE  (IOPORT_BASE + 0x00000400UL)
#define GPIOC_BASE  (IOPORT_BASE + 0x00000800UL)
#define GPIOH_BASE  (IOPORT_BASE + 0x00001C00UL)

//  AHB3 peripherals */
#define PWR_BASE       (AHB3PERIPH_BASE + 0x00000400UL)
#define EXTI_BASE      (AHB3PERIPH_BASE + 0x00000800UL)
#define RCC_BASE       (AHB3PERIPH_BASE + 0x00000000UL)
#define RNG_BASE       (AHB3PERIPH_BASE + 0x00001000UL)
#define HSEM_BASE      (AHB3PERIPH_BASE + 0x00001400UL)
#define AES_BASE       (AHB3PERIPH_BASE + 0x00001800UL)
#define PKA_BASE       (AHB3PERIPH_BASE + 0x00002000UL)
#define FLASH_REG_BASE (AHB3PERIPH_BASE + 0x00004000UL)

//  APB3 peripherals */
#define SUBGHZSPI_BASE (APB3PERIPH_BASE + 0x00000000UL)

//  Peripherals available on CPU1 external PPB bus */
#define DBGMCU_BASE (0xE0042000UL)

// #############################
// ### ADC                   ###
// ### RM0461 Page 427       ###
// #############################

#define ADC_ISR     (*(volatile uint32_t *)ADC_BASE + 0x00)        // ADC interrupt and status register
#define ADC_IER     (*(volatile uint32_t *)ADC_BASE + 0x04)        // ADC interrupt enable register
#define ADC_CR      (*(volatile uint32_t *)ADC_BASE + 0x08)        // ADC control register
#define ADC_CFGR1   (*(volatile uint32_t *)ADC_BASE + 0x0C)        // ADC configuration register 1
#define ADC_CFGR2   (*(volatile uint32_t *)ADC_BASE + 0x10)        // ADC configuration register 2
#define ADC_SMPR    (*(volatile uint32_t *)ADC_BASE + 0x14)        // ADC sampling time register
#define ADC_TR1     (*(volatile uint32_t *)ADC_BASE + 0x20)        // ADC watchdog threshold register
#define ADC_TR2     (*(volatile uint32_t *)ADC_BASE + 0x24)        // ADC watchdog threshold register
#define ADC_CHSELR  (*(volatile uint32_t *)ADC_BASE + 0x28)        // ADC group regular sequencer register
#define ADC_TR3     (*(volatile uint32_t *)ADC_BASE + 0x2C)        // ADC watchdog threshold register
#define ADC_DR      (*(volatile uint32_t *)ADC_BASE + 0x40)        // ADC Data register
#define ADC_AWD2CR  (*(volatile uint32_t *)ADC_BASE + 0xA0)        // ADC analog watchdog 2 configuration register
#define ADC_AWD3CR  (*(volatile uint32_t *)ADC_BASE + 0xA4)        // ADC analog watchdog 3 configuration register
#define ADC_CALFACT (*(volatile uint32_t *)ADC_BASE + 0xB4)        // ADC calibration factors

// #############################
// ### AES                   ###
// ### RM0461 Page 542       ###
// #############################

#define AES_CR    (*(volatile uint32_t *)AES_BASE + 0x00)        // AES control register
#define AES_SR    (*(volatile uint32_t *)AES_BASE + 0x04)        // AES status register
#define AES_DINR  (*(volatile uint32_t *)AES_BASE + 0x08)        // AES data input register
#define AES_DOUTR (*(volatile uint32_t *)AES_BASE + 0x0C)        // AES data output register
#define AES_KEYR0 (*(volatile uint32_t *)AES_BASE + 0x10)        // AES key registers
#define AES_KEYR1 (*(volatile uint32_t *)AES_BASE + 0x14)        //
#define AES_KEYR2 (*(volatile uint32_t *)AES_BASE + 0x18)        //
#define AES_KEYR3 (*(volatile uint32_t *)AES_BASE + 0x1C)        //
#define AES_KEYR4 (*(volatile uint32_t *)AES_BASE + 0x30)        //
#define AES_KEYR5 (*(volatile uint32_t *)AES_BASE + 0x34)        //
#define AES_KEYR6 (*(volatile uint32_t *)AES_BASE + 0x38)        //
#define AES_KEYR7 (*(volatile uint32_t *)AES_BASE + 0x3C)        //
#define AES_IVR0  (*(volatile uint32_t *)AES_BASE + 0x20)        // AES initialization vector registers
#define AES_IVR1  (*(volatile uint32_t *)AES_BASE + 0x24)        //
#define AES_IVR2  (*(volatile uint32_t *)AES_BASE + 0x28)        //
#define AES_IVR3  (*(volatile uint32_t *)AES_BASE + 0x2C)        //
#define AES_SUSP0 (*(volatile uint32_t *)AES_BASE + 0x40)        // AES suspend registers
#define AES_SUSP1 (*(volatile uint32_t *)AES_BASE + 0x44)        //
#define AES_SUSP2 (*(volatile uint32_t *)AES_BASE + 0x48)        //
#define AES_SUSP3 (*(volatile uint32_t *)AES_BASE + 0x4C)        //
#define AES_SUSP4 (*(volatile uint32_t *)AES_BASE + 0x50)        //
#define AES_SUSP5 (*(volatile uint32_t *)AES_BASE + 0x54)        //
#define AES_SUSP6 (*(volatile uint32_t *)AES_BASE + 0x58)        //
#define AES_SUSP7 (*(volatile uint32_t *)AES_BASE + 0x5C)        //

// #############################
// ### UART                  ###
// ### RM0461 Page 1011      ###
// #############################

#define UART1_CR1   (*(volatile uint32_t *)USART1_BASE + 0x00)        // UART control register 1
#define UART1_CR2   (*(volatile uint32_t *)USART1_BASE + 0x04)        // UART control register 2
#define UART1_CR3   (*(volatile uint32_t *)USART1_BASE + 0x08)        // UART control register 3
#define UART1_BRR   (*(volatile uint32_t *)USART1_BASE + 0x0C)        // UART baud rate register
#define UART1_GTPR  (*(volatile uint32_t *)USART1_BASE + 0x10)        // UART guard time and prescaler register
#define UART1_RTOR  (*(volatile uint32_t *)USART1_BASE + 0x14)        // UART receiver timeout register
#define UART1_RQR   (*(volatile uint32_t *)USART1_BASE + 0x18)        // UART request register
#define UART1_ISR   (*(volatile uint32_t *)USART1_BASE + 0x1C)        // UART interrupt and status register
#define UART1_ICR   (*(volatile uint32_t *)USART1_BASE + 0x20)        // UART interrupt flag clear register
#define UART1_RDR   (*(volatile uint32_t *)USART1_BASE + 0x24)        // UART receive data register
#define UART1_TDR   (*(volatile uint32_t *)USART1_BASE + 0x28)        // UART transmit data register
#define UART1_PRESC (*(volatile uint32_t *)USART1_BASE + 0x2C)        // UART prescaler register

#define UART2_CR1   (*(volatile uint32_t *)USART2_BASE + 0x00)        //
#define UART2_CR2   (*(volatile uint32_t *)USART2_BASE + 0x04)        //
#define UART2_CR3   (*(volatile uint32_t *)USART2_BASE + 0x08)        //
#define UART2_BRR   (*(volatile uint32_t *)USART2_BASE + 0x0C)        //
#define UART2_GTPR  (*(volatile uint32_t *)USART2_BASE + 0x10)        //
#define UART2_RTOR  (*(volatile uint32_t *)USART2_BASE + 0x14)        //
#define UART2_RQR   (*(volatile uint32_t *)USART2_BASE + 0x18)        //
#define UART2_ISR   (*(volatile uint32_t *)USART2_BASE + 0x1C)        //
#define UART2_ICR   (*(volatile uint32_t *)USART2_BASE + 0x20)        //
#define UART2_RDR   (*(volatile uint32_t *)USART2_BASE + 0x24)        //
#define UART2_TDR   (*(volatile uint32_t *)USART2_BASE + 0x28)        //
#define UART2_PRESC (*(volatile uint32_t *)USART2_BASE + 0x2C)        //

// #############################
// ### SPI                   ###
// ### RM0461 Page 1151      ###
// #############################

#define SPI2_CR1     (*(volatile uint32_t *)SPI2_BASE + 0x00)        // SPI control register 1
#define SPI2_CR2     (*(volatile uint32_t *)SPI2_BASE + 0x04)        // SPI control register 2
#define SPI2_SR      (*(volatile uint32_t *)SPI2_BASE + 0x08)        // SPI status register
#define SPI2_DR      (*(volatile uint32_t *)SPI2_BASE + 0x0C)        //  SPI data register
#define SPI2_CRCPR   (*(volatile uint32_t *)SPI2_BASE + 0x10)        // SPI CRC polynomial register
#define SPI2_RXCRCR  (*(volatile uint32_t *)SPI2_BASE + 0x14)        // SPI RX CRC register
#define SPI2_TXCRCR  (*(volatile uint32_t *)SPI2_BASE + 0x18)        // SPI TX CRC register
#define SPI2_I2SCFGR (*(volatile uint32_t *)SPI2_BASE + 0x1C)        // SPI_I2S configuration register
#define SPI2_I2SPR   (*(volatile uint32_t *)SPI2_BASE + 0x20)        // SPI_I2S prescaler register

