Strooom/STM32WLE5x-SX126X-LoRaWAN/src/general/stm32wle5.h
#define SPI_SX126X__CR1     (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x00)        //
#define SPI_SX126X__CR2     (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x04)        //
#define SPI_SX126X__SR      (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x08)        //
#define SPI_SX126X__DR      (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x0C)        //
#define SPI_SX126X__CRCPR   (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x10)        //
#define SPI_SX126X__RXCRCR  (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x14)        //
#define SPI_SX126X__TXCRCR  (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x18)        //
#define SPI_SX126X__I2SCFGR (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x1C)        //
#define SPI_SX126X__I2SPR   (*(volatile uint32_t *)SUBGHZSPI_BASE + 0x20)        //

// #############################
// ### RTC                   ###
// ### RM0461 Page 884       ###
// #############################

#define RTC_TR       (*(volatile uint32_t *)RTC_BASE + 0x00)        // RTC time register
#define RTC_DR       (*(volatile uint32_t *)RTC_BASE + 0x04)        // RTC date register
#define RTC_SSR      (*(volatile uint32_t *)RTC_BASE + 0x08)        // RTC sub second register
#define RTC_ICSR     (*(volatile uint32_t *)RTC_BASE + 0x0C)        // RTC initialization and status register
#define RTC_PRER     (*(volatile uint32_t *)RTC_BASE + 0x10)        // RTC prescaler register
#define RTC_WUTR     (*(volatile uint32_t *)RTC_BASE + 0x14)        //  RTC wakeup timer register
#define RTC_CR       (*(volatile uint32_t *)RTC_BASE + 0x18)        // RTC control register
#define RTC_WPR      (*(volatile uint32_t *)RTC_BASE + 0x24)        // RTC write protection register
#define RTC_CALR     (*(volatile uint32_t *)RTC_BASE + 0x28)        // RTC calibration register
#define RTC_SHIFTR   (*(volatile uint32_t *)RTC_BASE + 0x2C)        // RTC shift control register
#define RTC_TSTR     (*(volatile uint32_t *)RTC_BASE + 0x30)        // RTC time stamp time register
#define RTC_TSDR     (*(volatile uint32_t *)RTC_BASE + 0x34)        // RTC time stamp date register
#define RTC_TSSSR    (*(volatile uint32_t *)RTC_BASE + 0x38)        // RTC time-stamp sub second register
#define RTC_ALRMAR   (*(volatile uint32_t *)RTC_BASE + 0x40)        // RTC alarm A register
#define RTC_ALRMASSR (*(volatile uint32_t *)RTC_BASE + 0x44)        // RTC alarm A sub second register
#define RTC_ALMRBR   (*(volatile uint32_t *)RTC_BASE + 0x48)        // RTC alarm B register
#define RTC_ALRMBSSR (*(volatile uint32_t *)RTC_BASE + 0x4C)        // RTC alarm B sub second register
#define RTC_SR       (*(volatile uint32_t *)RTC_BASE + 0x50)        // RTC status register
#define RTC_MISR     (*(volatile uint32_t *)RTC_BASE + 0x54)        // RTC masked interrupt status register
#define RTC_SCR      (*(volatile uint32_t *)RTC_BASE + 0x5C)        // RTC status clear register
#define RTC_ALRABINR (*(volatile uint32_t *)RTC_BASE + 0x70)        // RTC alarm A binary register
#define RTC_ALRBBINR (*(volatile uint32_t *)RTC_BASE + 0x74)        // RTC alarm B binary register

// #############################
// ### RCC                   ###
// ### RM0461 Page 230       ###
// #############################

#define RCC_CR         (*(volatile uint32_t *)RCC_BASE + 0x00)         // RCC clock control register
#define RCC_ICSCR      (*(volatile uint32_t *)RCC_BASE + 0x04)         // RCC internal clock sources calibration register
#define RCC_CFGR       (*(volatile uint32_t *)RCC_BASE + 0x08)         // RCC clock configuration register
#define RCC_PLLCFGR    (*(volatile uint32_t *)RCC_BASE + 0x0C)         // RCC system PLL configuration register
#define RCC_CIER       (*(volatile uint32_t *)RCC_BASE + 0x18)         // RCC clock interrupt enable register
#define RCC_CIFR       (*(volatile uint32_t *)RCC_BASE + 0x1C)         // RCC clock interrupt flag register
#define RCC_CICR       (*(volatile uint32_t *)RCC_BASE + 0x20)         // RCC clock interrupt clear register
#define RCC_AHB1RSTR   (*(volatile uint32_t *)RCC_BASE + 0x28)         // RCC AHB1 peripheral reset register
#define RCC_AHB2RSTR   (*(volatile uint32_t *)RCC_BASE + 0x2C)         // RCC AHB2 peripheral reset register
#define RCC_AHB3RSTR   (*(volatile uint32_t *)RCC_BASE + 0x30)         // RCC AHB3 peripheral reset register
#define RCC_APB1RSTR1  (*(volatile uint32_t *)RCC_BASE + 0x38)         // RCC APB1 peripheral reset register 1
#define RCC_APB1RSTR1  (*(volatile uint32_t *)RCC_BASE + 0x3C)         // RCC APB1 peripheral reset register 2
#define RCC_APB2RSTR   (*(volatile uint32_t *)RCC_BASE + 0x40)         // RCC APB2 peripheral reset register
#define RCC_APB3RSTR   (*(volatile uint32_t *)RCC_BASE + 0x44)         // RCC APB3 peripheral reset register
#define RCC_AHB1ENR    (*(volatile uint32_t *)RCC_BASE + 0x48)         // RCC AHB1 peripheral clock enable register
#define RCC_AHB2ENR    (*(volatile uint32_t *)RCC_BASE + 0x4C)         // RCC AHB2 peripheral clock enable register
#define RCC_AHB3ENR    (*(volatile uint32_t *)RCC_BASE + 0x50)         // RCC AHB3 peripheral clock enable register
#define RCC_APB1ENR1   (*(volatile uint32_t *)RCC_BASE + 0x58)         // RCC APB1 peripheral clock enable register 1
#define RCC_APB1ENR2   (*(volatile uint32_t *)RCC_BASE + 0x5C)         // RCC APB1 peripheral clock enable register 2
#define RCC_APB2ENR    (*(volatile uint32_t *)RCC_BASE + 0x60)         // RCC APB2 peripheral clock enable register
#define RCC_APB3ENR    (*(volatile uint32_t *)RCC_BASE + 0x64)         // RCC APB3 peripheral clock enable register
#define RCC_AHB1SMENR  (*(volatile uint32_t *)RCC_BASE + 0x68)         // RCC AHB1 peripheral clocks enable in Sleep and Stop modes register
#define RCC_AHB2SMENR  (*(volatile uint32_t *)RCC_BASE + 0x6C)         // RCC AHB2 peripheral clocks enable in Sleep and Stop modes register
#define RCC_AHB3SMENR  (*(volatile uint32_t *)RCC_BASE + 0x70)         // RCC AHB3 peripheral clocks enable in Sleep and Stop modes register
#define RCC_APB1SMENR1 (*(volatile uint32_t *)RCC_BASE + 0x78)         // RCC APB1 peripheral clocks enable in Sleep and Stop modes register 1
#define RCC_APB1SMENR2 (*(volatile uint32_t *)RCC_BASE + 0x7C)         // RCC APB1 peripheral clocks enable in Sleep and Stop modes register 2
#define RCC_APB2SMENR  (*(volatile uint32_t *)RCC_BASE + 0x80)         // RCC APB2 peripheral clocks enable in Sleep and Stop modes register
#define RCC_APB3SMENR  (*(volatile uint32_t *)RCC_BASE + 0x84)         // RCC APB3 peripheral clocks enable in Sleep and Stop modes register
#define RCC_CCIPR      (*(volatile uint32_t *)RCC_BASE + 0x88)         // RCC peripherals independent clock configuration register
#define RCC_BDCR       (*(volatile uint32_t *)RCC_BASE + 0x90)         // RCC Backup domain control register
#define RCC_CSR        (*(volatile uint32_t *)RCC_BASE + 0x94)         // RCC clock control & status register
#define RCC_EXTCFGR    (*(volatile uint32_t *)RCC_BASE + 0x108)        // RCC extended clock recovery register


// #############################
// ### I2C                   ###
// #############################

#define I2C2_CR1      (*(volatile uint32_t *)I2C2_BASE + 0x00)        // I2C control register 1
#define I2C2_CR2      (*(volatile uint32_t *)I2C2_BASE + 0x04)        // I2C control register 2
#define I2C2_OAR1     (*(volatile uint32_t *)I2C2_BASE + 0x08)        // I2C own address register 1
#define I2C2_OAR2     (*(volatile uint32_t *)I2C2_BASE + 0x0C)        // I2C own address register 2
#define I2C2_TIMINGR  (*(volatile uint32_t *)I2C2_BASE + 0x10)        // I2C timing register
#define I2C2_TIMEOUTR (*(volatile uint32_t *)I2C2_BASE + 0x14)        // I2C timeout register
#define I2C2_ISR      (*(volatile uint32_t *)I2C2_BASE + 0x18)        // I2C interrupt and status register
#define I2C2_ICR      (*(volatile uint32_t *)I2C2_BASE + 0x1C)        // I2C interrupt clear register
#define I2C2_PECR     (*(volatile uint32_t *)I2C2_BASE + 0x20)        // I2C PEC register
#define I2C2_RXDR     (*(volatile uint32_t *)I2C2_BASE + 0x24)        // I2C receive data register
#define I2C2_TXDR     (*(volatile uint32_t *)I2C2_BASE + 0x28)        // I2C transmit data register


// #############################
// ### GPIO                  ###
// #############################

