Strooom/STM32WLE5x-SX126X-LoRaWAN/src/general/stm32wle5.h
#define PORTA_MODER  (*(volatile uint32_t *)GPIOA_BASE + 0x00)        // GPIO port mode register
#define PORTA_OTYPER (*(volatile uint32_t *)GPIOA_BASE + 0x04)        // GPIO port output type register
#define PORTA_SPEEDR (*(volatile uint32_t *)GPIOA_BASE + 0x08)        // GPIO port output speed register
#define PORTA_PUPDR  (*(volatile uint32_t *)GPIOA_BASE + 0x0C)        // GPIO port pull-up/pull-down register
#define PORTA_IDR    (*(volatile uint32_t *)GPIOA_BASE + 0x10)        // GPIO port input data register
#define PORTA_ODR    (*(volatile uint32_t *)GPIOA_BASE + 0x14)        // GPIO port output data register
#define PORTA_BSRR   (*(volatile uint32_t *)GPIOA_BASE + 0x18)        // GPIO port bit set/reset register
#define PORTA_LCKR   (*(volatile uint32_t *)GPIOA_BASE + 0x1C)        // GPIO port configuration lock register
#define PORTA_AFR1   (*(volatile uint32_t *)GPIOA_BASE + 0x20)        // GPIO alternate function low register
#define PORTA_AFR2   (*(volatile uint32_t *)GPIOA_BASE + 0x24)        // GPIO alternate function high register
#define PORTA_BRR    (*(volatile uint32_t *)GPIOA_BASE + 0x28)        // GPIO port bit reset register

#define PORTB_MODER  (*(volatile uint32_t *)GPIOB_BASE + 0x00)        // GPIO port mode register
#define PORTB_OTYPER (*(volatile uint32_t *)GPIOB_BASE + 0x04)        // GPIO port output type register
#define PORTB_SPEEDR (*(volatile uint32_t *)GPIOB_BASE + 0x08)        // GPIO port output speed register
#define PORTB_PUPDR  (*(volatile uint32_t *)GPIOB_BASE + 0x0C)        // GPIO port pull-up/pull-down register
#define PORTB_IDR    (*(volatile uint32_t *)GPIOB_BASE + 0x10)        // GPIO port input data register
#define PORTB_ODR    (*(volatile uint32_t *)GPIOB_BASE + 0x14)        // GPIO port output data register
#define PORTB_BSRR   (*(volatile uint32_t *)GPIOB_BASE + 0x18)        // GPIO port bit set/reset register
#define PORTB_LCKR   (*(volatile uint32_t *)GPIOB_BASE + 0x1C)        // GPIO port configuration lock register
#define PORTB_AFR1   (*(volatile uint32_t *)GPIOB_BASE + 0x20)        // GPIO alternate function low register
#define PORTB_AFR2   (*(volatile uint32_t *)GPIOB_BASE + 0x24)        // GPIO alternate function high register
#define PORTB_BRR    (*(volatile uint32_t *)GPIOB_BASE + 0x28)        // GPIO port bit reset register


// #############################
// ### RNG                   ###
// #############################

#define RNG_CR   (*(volatile uint32_t *)RNG_BASE + 0x00)        // RNG control register
#define RNG_SR   (*(volatile uint32_t *)RNG_BASE + 0x04)        // RNG status register
#define RNG_DR   (*(volatile uint32_t *)RNG_BASE + 0x08)        // RNG data register
#define RNG_HTCR (*(volatile uint32_t *)RNG_BASE + 0x10)        // RNG health test control register


#define VREFBUF_SC0_CAL (*(volatile uint32_t *)0x1FFF 75F0)        //   Address of VREFBUF trimming value for VRS=0, VREF_SC0 in STM32WL datasheet */
#define VREFBUF_SC1_CAL (*(volatile uint32_t *)0x1FFF 7530)        //   Address of VREFBUF trimming value for VRS=1, VREF_SC1 in STM32WL datasheet */

#define setBitInRegister(REG, BIT)    ((REG) |= (BIT))
#define clearBitInREgister(REG, BIT)  ((REG) &= ~(BIT))
#define readBitFromRegister(REG, BIT) ((REG) & (BIT))

// We could also have some simple inline function definitions for that.

/* Use of CMSIS compiler intrinsics for register exclusive access */
/* Atomic 32-bit register access macro to set one or several bits */
#define ATOMIC_SET_BIT(REG, BIT)                                  \
    do {                                                          \
        uint32_t val;                                             \
        do {                                                      \
            val = __LDREXW((__IO uint32_t *)&(REG)) | (BIT);      \
        } while ((__STREXW(val, (__IO uint32_t *)&(REG))) != 0U); \
    } while (0)

/* Atomic 32-bit register access macro to clear one or several bits */
#define ATOMIC_CLEAR_BIT(REG, BIT)                                \
    do {                                                          \
        uint32_t val;                                             \
        do {                                                      \
            val = __LDREXW((__IO uint32_t *)&(REG)) & ~(BIT);     \
        } while ((__STREXW(val, (__IO uint32_t *)&(REG))) != 0U); \
    } while (0)
